app/Models/Article.php

    public function getAllArticles () {
        return $this->findAll();
---
SELECT *
FROM `articles`

    public function getOneArticle (int $id) {
        return $this->find($id);
---
SELECT *
FROM `articles`
WHERE `articles`.`id` = 3